{"results": {"content_files": {"name": "README.rst", "path": "README.rst", "content": "..\n  Copyright 2017-2019 The FIAAS Authors\n\n  Licensed under the Apache License, Version 2.0 (the \"License\");\n  you may not use this file except in compliance with the License.\n  You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n  Unless required by applicable law or agreed to in writing, software\n  distributed under the License is distributed on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n  See the License for the specific language governing permissions and\n  limitations under the License.\n\npublish - Tool to create a release of a Python package\n======================================================\n\n|Codacy Quality Badge| |Codacy Coverage Badge|\n\n\n.. |Codacy Quality Badge| image:: https://api.codacy.com/project/badge/Grade/bd7d31c7ceac43eb81884b2adc4ba3ed\n    :target: https://www.codacy.com/app/fiaas/publish?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=fiaas/publish&amp;utm_campaign=Badge_Grade\n.. |Codacy Coverage Badge| image:: https://api.codacy.com/project/badge/Coverage/bd7d31c7ceac43eb81884b2adc4ba3ed\n    :target: https://www.codacy.com/app/fiaas/publish?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=fiaas/publish&amp;utm_campaign=Badge_Coverage\n\npublish is a tool to package and release a python project. It will create a changelog and upload artifacts to Github and PyPI.\n\nIt is created for and by the `FIAAS project`_, and used for most of our projects.\n\n.. _`FIAAS project`: https://github.com/fiaas\n\n\nUsage\n-----\n\nIn order to use publish, you must first install it::\n\n    pip install publish\n\n\nUnder the covers, publish uses github-release_ and twine_ to do most of the work, and those tools require credentials for Github and PyPI to be available in environment variables::\n\n    export GITHUB_TOKEN=gh-token\n    export TWINE_USERNAME=pypi-user\n    export TWINE_PASSWORD=pypi-pass\n\nIn order to know where to upload the artifacts, you must specify an organization, and a repository::\n\n    publish fiaas k8s\n\n\nBefore uploading anything, publish will verify that the current checkout is suitable to be released, and checks the following items:\n\n* Are all files either ignored or in version control?\n* Is every change committed?\n* Is the currently checked out code tagged with an annotated tag?\n* Does that tag use the convention ``v<major>.<minor>.<bugfix>``?\n\nIf the answer to all of these is yes, the name of the tag is used as the version to release. A changelog is generated from the git log, source tarballs and wheels are built, the release is created in Github and PyPI, and the files are uploaded.\n\nWhen uploading a release to Github, the changelog is attached to the release automatically.\n\nIn order for the changelog to be attached to the release on PyPI, it needs to be included in the long description generated by ``setup.py``. To help with this, the changelog is written to a file, and the name of the file is available in an environment variable called ``CHANGELOG_FILE``. Append the contents of this file to your long description, and it will be included in the description on PyPI.\n\n.. _github-release: https://github.com/j0057/github-release\n.. _twine: https://github.com/pypa/twine\n"}}}